Wafleem/STM32N6-EdgeAI-CV/Application/NUCLEO-N657X0-Q/Src/main.c
 /**
 ******************************************************************************
 * @file    main.c
 * @author  GPM Application Team
 *
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
#include <math.h>
#include <string.h>
#include <unistd.h>

#include "cmw_camera.h"
#include "scrl.h"
#include "stm32n6xx_nucleo_bus.h"
#include "stm32n6xx_nucleo_xspi.h"
#include "stm32n6xx_nucleo.h"
#include "stm32_lcd.h"
#include "app_fuseprogramming.h"
#include "stm32_lcd_ex.h"
#include "app_postprocess.h"
#include "stai.h"
#include "stai_ext.h"
#include "stai_network.h"
#include "app_camerapipeline.h"
#include "main.h"
#include <stdio.h>
#include "app_config.h"
#include "crop_img.h"
#include "logger.h"
#include "stlogo.h"

CLASSES_TABLE;

#define LCD_BG_WIDTH  SCREEN_WIDTH
#define LCD_BG_HEIGHT SCREEN_HEIGHT
#define LCD_FG_WIDTH  SCREEN_WIDTH
#define LCD_FG_HEIGHT SCREEN_HEIGHT

#define LCD_FG_FRAMEBUFFER_SIZE  (LCD_FG_WIDTH * LCD_FG_HEIGHT * 2)

#define UTIL_LCD_COLOR_TRANSPARENT 0

#ifndef APP_GIT_SHA1_STRING
#define APP_GIT_SHA1_STRING "dev"
#endif
#ifndef APP_VERSION_STRING
#define APP_VERSION_STRING "unversioned"
#endif


typedef struct
{
  uint32_t X0;
  uint32_t Y0;
  uint32_t XSize;
  uint32_t YSize;
} Rectangle_TypeDef;

/* Lcd Background area */
Rectangle_TypeDef lcd_bg_area = {
#if DISPLAY_ASPECT_RATIO_MODE == ASPECT_RATIO_CROP || DISPLAY_ASPECT_RATIO_MODE == ASPECT_RATIO_FIT
  .X0 = (LCD_BG_WIDTH - LCD_BG_HEIGHT) / 2,
#else
  .X0 = 0,
#endif
  .Y0 = 0,
  .XSize = 0,
  .YSize = 0,
};

/* Lcd Foreground area */
Rectangle_TypeDef lcd_fg_area = {
#if DISPLAY_ASPECT_RATIO_MODE == ASPECT_RATIO_CROP || DISPLAY_ASPECT_RATIO_MODE == ASPECT_RATIO_FIT
  .X0 = (LCD_FG_WIDTH - LCD_FG_HEIGHT) / 2,
#else
  .X0 = 0,
#endif
  .Y0 = 0,
  .XSize = 0,
  .YSize = 0,
};

#define NUMBER_COLORS 10
const uint32_t colors[NUMBER_COLORS] = {
    UTIL_LCD_COLOR_GREEN,
    UTIL_LCD_COLOR_RED,
    UTIL_LCD_COLOR_CYAN,
    UTIL_LCD_COLOR_MAGENTA,
    UTIL_LCD_COLOR_YELLOW,
    UTIL_LCD_COLOR_GRAY,
    UTIL_LCD_COLOR_BLACK,
    UTIL_LCD_COLOR_BROWN,
    UTIL_LCD_COLOR_BLUE,
    UTIL_LCD_COLOR_ORANGE
};

#if POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V2_UI
  od_yolov2_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V5_UU
  od_yolov5_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V8_UI
  od_yolov8_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_ST_YOLOX_UI
  od_st_yolox_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_SSD_UI
  od_ssd_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_ST_YOLOD_UI
  od_yolo_d_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_BLAZEFACE_UI
  od_blazeface_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_CUSTOM
  od_obb_custom_pp_static_param_t pp_params;
#else
  #error "PostProcessing type not supported"
#endif

UART_HandleTypeDef huart1;
volatile int32_t cameraFrameReceived;
volatile uint32_t g_app_trace_stage = 0;
volatile uint32_t g_app_trace_frame_index = 0;
stai_ptr nn_in;
void* pp_input;
od_pp_out_t pp_output;
static float nn_input_scale = 0.0f;
static int32_t nn_input_zero_point = 0;
static uint32_t g_nn_in_len = 0;
static stai_size g_number_output = 0;

enum
{
  APP_TRACE_STAGE_BOOT = 1,
  APP_TRACE_STAGE_NN_INIT,
  APP_TRACE_STAGE_POSTPROCESS_INIT,
  APP_TRACE_STAGE_CAMERA_INIT,
  APP_TRACE_STAGE_DISPLAY_INIT,
  APP_TRACE_STAGE_DISPLAY_PIPE_START,
  APP_TRACE_STAGE_WAITING_FOR_FRAME,
  APP_TRACE_STAGE_PREPROCESS,
  APP_TRACE_STAGE_INFERENCE_START,
  APP_TRACE_STAGE_INFERENCE_POLL,
  APP_TRACE_STAGE_POSTPROCESS,
  APP_TRACE_STAGE_DISPLAY
};

#define ALIGN_TO_16(value) (((value) + 15) & ~15)

/* When NN input dimensions are not a multiple of 16, the DCMIPP output needs cropping */
#if (STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL) != ALIGN_TO_16(STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL)
#define DCMIPP_NN_NEEDS_CROP 1
#else
#define DCMIPP_NN_NEEDS_CROP 0
#endif

#if (STAI_NETWORK_IN_1_FLAGS & STAI_FLAG_CHANNEL_FIRST)
#define NN_INPUT_IS_CHANNEL_FIRST 1
#else
#define NN_INPUT_IS_CHANNEL_FIRST 0
#endif

#define NN_INPUT_NEEDS_PREPROC (DCMIPP_NN_NEEDS_CROP || NN_INPUT_IS_CHANNEL_FIRST)

#if DCMIPP_NN_NEEDS_CROP
#define DCMIPP_OUT_NN_LEN (ALIGN_TO_16(STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL) * STAI_NETWORK_IN_1_HEIGHT)
#define DCMIPP_OUT_NN_BUFF_LEN (DCMIPP_OUT_NN_LEN + 32 - DCMIPP_OUT_NN_LEN%32)

__attribute__ ((aligned (32)))
static uint8_t dcmipp_out_nn[DCMIPP_OUT_NN_BUFF_LEN];
#endif

#if NN_INPUT_IS_CHANNEL_FIRST
#define NN_INPUT_VISITED_BYTES ((STAI_NETWORK_IN_1_SIZE_BYTES + 7U) / 8U)
static uint8_t nn_input_transpose_visited[NN_INPUT_VISITED_BYTES];
#endif

/* model */
STAI_NETWORK_CONTEXT_DECLARE(network_context, STAI_NETWORK_CONTEXT_SIZE)
/* Lcd Background Buffer */
__attribute__ ((aligned (32)))
static uint8_t lcd_bg_buffer[LCD_BG_WIDTH * LCD_BG_HEIGHT * 2];
/* Lcd Foreground Buffer */
__attribute__ ((aligned (32)))
static uint8_t lcd_fg_buffer[2][LCD_FG_WIDTH * LCD_FG_HEIGHT * 2];
static int lcd_fg_buffer_rd_idx;
/* screen buffer */
__attribute__ ((aligned (32)))
static uint8_t screen_buffer[LCD_FG_WIDTH * LCD_FG_HEIGHT * 2];

static void SystemClock_Config(void);
static void CONSOLE_Config(void);
static void NPURam_enable(void);
static void NPUCache_config(void);
static void Display_NetworkOutput(od_pp_out_t *p_postprocess, uint32_t inference_ms);
static void Display_init(void);
static void LogCameraPipelineState(const char *tag);
static void LogInferenceRuntimeState(const char *tag);
static void Security_Config(void);
static void set_clk_sleep_mode(void);
static void IAC_Config(void);
static void Display_WelcomeScreen(void);
static uint32_t Display_GetBoxColor(uint32_t class_index);
static void Hardware_init(void);
static void NeuralNetwork_init(uint32_t *nn_in_length, stai_ptr *nn_out, stai_size *number_output, int32_t nn_out_len[]);
static stai_return_code RunInferenceWithTracing(uint32_t frame_index);
static uint32_t SampleBytesChecksum32(const uint8_t *data, uint32_t len);
static uint8_t ShouldTraceFrame(uint32_t frame_index);
#if NN_INPUT_NEEDS_PREPROC
static void PreprocessCameraFrameToNNInput(const uint8_t *src, uint8_t *dst, uint32_t src_stride);
#endif

#if NN_INPUT_IS_CHANNEL_FIRST
static uint32_t HwcIndexToChwIndex(uint32_t index)
{
  uint32_t pixel_index = index / STAI_NETWORK_IN_1_CHANNEL;
  uint32_t channel_index = index % STAI_NETWORK_IN_1_CHANNEL;
  return (channel_index * STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_HEIGHT) + pixel_index;
}

static uint8_t VisitedBitIsSet(uint32_t index)
{
  return (nn_input_transpose_visited[index >> 3] & (uint8_t)(1U << (index & 7U))) != 0U;
}

