Wafleem/STM32N6-EdgeAI-CV/Application/NUCLEO-N657X0-Q/Src/main.c
static void SetVisitedBit(uint32_t index)
{
  nn_input_transpose_visited[index >> 3] |= (uint8_t)(1U << (index & 7U));
}

static void TransposeHwcToChwInPlace(uint8_t *buffer)
{
  memset(nn_input_transpose_visited, 0, sizeof(nn_input_transpose_visited));

  for (uint32_t i = 0; i < STAI_NETWORK_IN_1_SIZE_BYTES; i++)
  {
    uint32_t current;
    uint8_t value;

    if (VisitedBitIsSet(i) != 0U)
    {
      continue;
    }

    current = i;
    value = buffer[i];

    while (VisitedBitIsSet(current) == 0U)
    {
      uint32_t next = HwcIndexToChwIndex(current);
      uint8_t next_value = buffer[next];

      SetVisitedBit(current);
      buffer[next] = value;
      value = next_value;
      current = next;
    }
  }
}
#endif

static uint32_t SampleBytesChecksum32(const uint8_t *data, uint32_t len)
{
  uint32_t sum = 0;

  for (uint32_t i = 0; i < len; i++)
  {
    sum = (sum * 131U) + data[i];
  }

  return sum;
}

static uint8_t ShouldTraceFrame(uint32_t frame_index)
{
  return ((frame_index < 5U) || ((frame_index % 30U) == 0U)) ? 1U : 0U;
}

#if NN_INPUT_NEEDS_PREPROC
static void PreprocessCameraFrameToNNInput(const uint8_t *src, uint8_t *dst, uint32_t src_stride)
{
  const uint32_t row_bytes = STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL;

#if APP_MODEL_PROFILE == APP_MODEL_PROFILE_SAFAL_OBB
  if (NN_INPUT_IS_CHANNEL_FIRST != 0)
  {
    const uint32_t plane_size = STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_HEIGHT;

    if (STAI_NETWORK_IN_1_FORMAT == STAI_FORMAT_U8)
    {
      if (src == dst)
      {
        TransposeHwcToChwInPlace(dst);
        return;
      }

      for (uint32_t y = 0; y < STAI_NETWORK_IN_1_HEIGHT; y++)
      {
        const uint8_t *src_row = src + (y * src_stride);

        for (uint32_t x = 0; x < STAI_NETWORK_IN_1_WIDTH; x++)
        {
          const uint32_t src_index = x * STAI_NETWORK_IN_1_CHANNEL;
          const uint32_t dst_index = (y * STAI_NETWORK_IN_1_WIDTH) + x;

          dst[dst_index] = src_row[src_index];
          dst[plane_size + dst_index] = src_row[src_index + 1U];
          dst[(2U * plane_size) + dst_index] = src_row[src_index + 2U];
        }
      }
      return;
    }
  }

  if (STAI_NETWORK_IN_1_FORMAT == STAI_FORMAT_U8)
  {
    for (uint32_t y = 0; y < STAI_NETWORK_IN_1_HEIGHT; y++)
    {
      memcpy(dst + (y * row_bytes), src + (y * src_stride), row_bytes);
    }
    return;
  }

  int8_t *dst_i8 = (int8_t *)dst;
  float scaled_full_range = nn_input_scale * 255.0f;
  for (uint32_t y = 0; y < STAI_NETWORK_IN_1_HEIGHT; y++)
  {
    const uint8_t *src_row = src + (y * src_stride);
    int8_t *dst_row = dst_i8 + (y * row_bytes);

    if ((nn_input_zero_point == -128) && (scaled_full_range > 0.999f) && (scaled_full_range < 1.001f))
    {
      for (uint32_t x = 0; x < row_bytes; x++)
      {
        dst_row[x] = (int8_t)((int32_t)src_row[x] - 128);
      }
    }
    else
    {
      for (uint32_t x = 0; x < row_bytes; x++)
      {
        float normalized = (float)src_row[x] / 255.0f;
        int32_t quantized = (int32_t)lroundf(normalized / nn_input_scale) + nn_input_zero_point;

        if (quantized < -128)
        {
          quantized = -128;
        }
        else if (quantized > 127)
        {
          quantized = 127;
        }

        dst_row[x] = (int8_t)quantized;
      }
    }
  }
#else
  for (uint32_t y = 0; y < STAI_NETWORK_IN_1_HEIGHT; y++)
  {
    memcpy(dst + (y * row_bytes), src + (y * src_stride), row_bytes);
  }
#endif
}
#endif

static void LogCameraPipelineState(const char *tag)
{
  DCMIPP_HandleTypeDef *hcamera_dcmipp = CMW_CAMERA_GetDCMIPPHandle();

  printf("TRACE: %s dcmipp_state=%lu pipe1_state=%lu pipe2_state=%lu err=0x%08lX cmsr1=0x%08lX cmsr2=0x%08lX cmier=0x%08lX\n",
         tag,
         (unsigned long) HAL_DCMIPP_GetState(hcamera_dcmipp),
         (unsigned long) HAL_DCMIPP_PIPE_GetState(hcamera_dcmipp, DCMIPP_PIPE1),
         (unsigned long) HAL_DCMIPP_PIPE_GetState(hcamera_dcmipp, DCMIPP_PIPE2),
         (unsigned long) HAL_DCMIPP_GetError(hcamera_dcmipp),
         (unsigned long) hcamera_dcmipp->Instance->CMSR1,
         (unsigned long) hcamera_dcmipp->Instance->CMSR2,
         (unsigned long) hcamera_dcmipp->Instance->CMIER);
}

static void LogInferenceRuntimeState(const char *tag)
{
  stai_return_code first_error = stai_network_get_error(network_context);
  stai_return_code run_status = stai_ext_network_get_nn_run_status(network_context);

  printf("TRACE: %s stage=%lu frame=%lu tick=%lu nn_in=%p nn_in_len=%lu first_error=0x%06lX run_status=0x%06lX\n",
         tag,
         (unsigned long) g_app_trace_stage,
         (unsigned long) g_app_trace_frame_index,
         (unsigned long) HAL_GetTick(),
         nn_in,
         (unsigned long) g_nn_in_len,
         (unsigned long) first_error,
         (unsigned long) run_status);
}

static stai_return_code RunInferenceWithTracing(uint32_t frame_index)
{
  uint32_t inference_start = HAL_GetTick();
  uint32_t iter = 0;
  stai_return_code ret;

  g_app_trace_stage = APP_TRACE_STAGE_INFERENCE_START;
  ret = stai_network_run(network_context, STAI_MODE_ASYNC);
  if (ret >= STAI_ERROR_GENERIC)
  {
    printf("ERROR: main loop: frame=%lu stai_network_run ret=0x%06lX first_error=0x%06lX\n",
           (unsigned long) frame_index,
           (unsigned long) ret,
           (unsigned long) stai_network_get_error(network_context));
    return ret;
  }

  while (1)
  {
    stai_return_code status = stai_ext_network_get_nn_run_status(network_context);
    uint32_t elapsed_ms = HAL_GetTick() - inference_start;

    if (status == STAI_DONE)
    {
      stai_return_code reset_ret = stai_ext_network_new_inference(network_context);
      if (reset_ret >= STAI_ERROR_GENERIC)
      {
        printf("ERROR: main loop: frame=%lu inference reset error=0x%06lX elapsed_ms=%lu\n",
               (unsigned long) frame_index,
               (unsigned long) reset_ret,
               (unsigned long) elapsed_ms);
      }
      return reset_ret;
    }

    if (status >= STAI_ERROR_GENERIC)
    {
      printf("ERROR: main loop: frame=%lu inference status error=0x%06lX elapsed_ms=%lu\n",
             (unsigned long) frame_index,
             (unsigned long) status,
             (unsigned long) elapsed_ms);
      return status;
    }

    if (elapsed_ms > 3000U)
    {
      printf("ERROR: main loop: frame=%lu inference timeout elapsed_ms=%lu status=0x%06lX first_error=0x%06lX\n",
             (unsigned long) frame_index,
             (unsigned long) elapsed_ms,
             (unsigned long) status,
             (unsigned long) stai_network_get_error(network_context));
      LogCameraPipelineState("main: inference-timeout");
      return STAI_ERROR_NETWORK_INVALID_RUNTIME;
    }

    g_app_trace_stage = APP_TRACE_STAGE_INFERENCE_POLL;
    if (status == STAI_RUNNING_WFE)
    {
      stai_ext_wfe();
    }

