Wafleem/STM32N6-EdgeAI-CV/Application/NUCLEO-N657X0-Q/Src/main.c
    ret = stai_ext_network_run_continue(network_context);
    if (ret >= STAI_ERROR_GENERIC)
    {
      printf("ERROR: main loop: frame=%lu inference continue error=0x%06lX elapsed_ms=%lu\n",
             (unsigned long) frame_index,
             (unsigned long) ret,
             (unsigned long) elapsed_ms);
      return ret;
    }
    iter++;
  }
}


/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
  g_app_trace_stage = APP_TRACE_STAGE_BOOT;
  Hardware_init();

  /*** NN Init ****************************************************************/
  uint32_t nn_in_len = 0;
  stai_size number_output = 0;
  stai_ptr nn_out[STAI_NETWORK_OUT_NUM] = {0};
  int32_t nn_out_len[STAI_NETWORK_OUT_NUM] = {0};

  g_app_trace_stage = APP_TRACE_STAGE_NN_INIT;
  NeuralNetwork_init(&nn_in_len, nn_out, &number_output, nn_out_len);

  /*** Post Processing Init ***************************************************/
  stai_network_info info;
  int ret;

  g_app_trace_stage = APP_TRACE_STAGE_POSTPROCESS_INIT;
  ret = stai_network_get_info(network_context, &info);
  assert(ret == STAI_SUCCESS);
  ret = app_postprocess_init(&pp_params, &info);
  assert(ret == 0);

  /*** Camera Init ************************************************************/
  uint32_t pitch_nn = 0;
  g_app_trace_stage = APP_TRACE_STAGE_CAMERA_INIT;
  CameraPipeline_Init((uint32_t *[2]) {&lcd_bg_area.XSize, &lcd_fg_area.XSize}, (uint32_t *[2]) {&lcd_bg_area.YSize, &lcd_fg_area.YSize}, &pitch_nn);

  g_app_trace_stage = APP_TRACE_STAGE_DISPLAY_INIT;
  Display_init();

  /* Start LCD Display camera pipe stream */
  g_app_trace_stage = APP_TRACE_STAGE_DISPLAY_PIPE_START;
  CameraPipeline_DisplayPipe_Start(lcd_bg_buffer, CMW_MODE_CONTINUOUS);

  /*** App header *************************************************************/
  printf("========================================\n");
  printf("STM32N6-GettingStarted-ObjectDetection %s (%s)\n", APP_VERSION_STRING, APP_GIT_SHA1_STRING);
  printf("Build date & time: %s %s\n", __DATE__, __TIME__);
#if defined(__GNUC__)
  printf("Compiler: GCC %d.%d.%d\n", __GNUC__, __GNUC_MINOR__, __GNUC_PATCHLEVEL__);
#elif defined(__ICCARM__)
  printf("Compiler: IAR EWARM %d.%d.%d\n", __VER__ / 1000000, (__VER__ / 1000) % 1000 ,__VER__ % 1000);
#else
  printf("Compiler: Unknown\n");
#endif
  printf("HAL: %lu.%lu.%lu\n", __STM32N6xx_HAL_VERSION_MAIN, __STM32N6xx_HAL_VERSION_SUB1, __STM32N6xx_HAL_VERSION_SUB2);
  printf("STEdgeAI Tools: %d.%d.%d\n", STAI_TOOLS_VERSION_MAJOR, STAI_TOOLS_VERSION_MINOR, STAI_TOOLS_VERSION_MICRO);
  printf("NN model: %s\n", STAI_NETWORK_ORIGIN_MODEL_NAME);
  printf("Model profile: %s\n", APP_MODEL_PROFILE_NAME);
  printf("Calibration: %s\n", APP_MODEL_CALIBRATION_NAME);
  printf("Display: bg=%lux%lu@%lu,%lu fg=%lux%lu@%lu,%lu nn_pitch=%lu color_swap=%u chw=%u\n",
         (unsigned long) lcd_bg_area.XSize, (unsigned long) lcd_bg_area.YSize,
         (unsigned long) lcd_bg_area.X0, (unsigned long) lcd_bg_area.Y0,
         (unsigned long) lcd_fg_area.XSize, (unsigned long) lcd_fg_area.YSize,
         (unsigned long) lcd_fg_area.X0, (unsigned long) lcd_fg_area.Y0,
         (unsigned long) pitch_nn,
         (unsigned int) COLOR_MODE,
         (unsigned int) NN_INPUT_IS_CHANNEL_FIRST);
  printf("========================================\n");

  /*** App Loop ***************************************************************/
  uint32_t app_loop_trace_count = 0;
  while (1)
  {
    g_app_trace_frame_index = app_loop_trace_count;
    CameraPipeline_IspUpdate();

#if DCMIPP_NN_NEEDS_CROP
    /* Start NN camera single capture Snapshot into intermediate buffer */
    CameraPipeline_NNPipe_Start(dcmipp_out_nn, CMW_MODE_SNAPSHOT);
#else
    /* Start NN camera single capture Snapshot directly into NN input */
    CameraPipeline_NNPipe_Start(nn_in, CMW_MODE_SNAPSHOT);
#endif

    g_app_trace_stage = APP_TRACE_STAGE_WAITING_FOR_FRAME;
    uint32_t frame_wait_start = HAL_GetTick();
    while (cameraFrameReceived == 0)
    {
      if ((HAL_GetTick() - frame_wait_start) > 500U)
      {
        printf("ERROR: main: timeout waiting for NN frame event after pipe2 snapshot start\n");
        LogInferenceRuntimeState("main: nn-frame-timeout");
        LogCameraPipelineState("main: nn-wait-timeout");
        assert(0);
      }
    }
    cameraFrameReceived = 0;
    if (app_loop_trace_count < 5U)
    {
      printf("TRACE: main loop: frame=%lu camera frame received\n",
             (unsigned long) app_loop_trace_count);
    }

    uint32_t ts[2] = { 0 };

#if NN_INPUT_NEEDS_PREPROC
    /*
     * Crop/copy/quantize the camera frame into the NN input buffer.
     * The DCMIPP hardware may pad each row to a 16-byte boundary, and
     * channel-first models need the interleaved camera RGB transposed to CHW.
     */
    g_app_trace_stage = APP_TRACE_STAGE_PREPROCESS;
#if DCMIPP_NN_NEEDS_CROP
    SCB_InvalidateDCache_by_Addr(dcmipp_out_nn, sizeof(dcmipp_out_nn));
    PreprocessCameraFrameToNNInput(dcmipp_out_nn, nn_in, pitch_nn);
#else
    SCB_InvalidateDCache_by_Addr(nn_in, nn_in_len);
    PreprocessCameraFrameToNNInput(nn_in, nn_in, pitch_nn);
#endif
    SCB_CleanInvalidateDCache_by_Addr(nn_in, nn_in_len);
#else
    g_app_trace_stage = APP_TRACE_STAGE_PREPROCESS;
    SCB_InvalidateDCache_by_Addr(nn_in, nn_in_len);
#endif

    ts[0] = HAL_GetTick();
    if (ShouldTraceFrame(app_loop_trace_count) != 0U)
    {
      uint32_t sample_len = (nn_in_len < 64U) ? nn_in_len : 64U;
      const uint8_t *nn_bytes = (const uint8_t *)nn_in;
      uint32_t plane_size = STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_HEIGHT;
      printf("TRACE: NN input: frame=%lu pitch=%lu align=0x%lX checksum64=0x%08lX sample=[%u %u %u %u] output0_len=%ld\n",
             (unsigned long) app_loop_trace_count,
             (unsigned long) pitch_nn,
             (unsigned long) (((uintptr_t)nn_in) & 31U),
             (unsigned long) SampleBytesChecksum32((const uint8_t *)nn_in, sample_len),
             (unsigned int) nn_bytes[0],
             (unsigned int) nn_bytes[1],
             (unsigned int) nn_bytes[plane_size],
             (unsigned int) nn_bytes[2U * plane_size],
             (long) nn_out_len[0]);
    }
    ret = RunInferenceWithTracing(app_loop_trace_count);
    assert(ret == 0);
    ts[1] = HAL_GetTick();

    g_app_trace_stage = APP_TRACE_STAGE_POSTPROCESS;
    int32_t ret = app_postprocess_run((void **) nn_out, number_output, &pp_output, &pp_params);
    assert(ret == 0);
    if (ShouldTraceFrame(app_loop_trace_count) != 0U)
    {
      printf("TRACE: frame summary: frame=%lu inference_ms=%lu detections=%lu\n",
             (unsigned long) app_loop_trace_count,
             (unsigned long) (ts[1] - ts[0]),
             (unsigned long) pp_output.nb_detect);
    }

    g_app_trace_stage = APP_TRACE_STAGE_DISPLAY;
    Display_NetworkOutput(&pp_output, ts[1] - ts[0]);
    /* Discard nn_out region (used by pp_input and pp_outputs variables) to avoid Dcache evictions during nn inference */
    for (int i = 0; i < number_output; i++)
    {
      void *tmp = nn_out[i];
      SCB_InvalidateDCache_by_Addr(tmp, nn_out_len[i]);
    }
    app_loop_trace_count++;
  }
}


static void Hardware_init(void)
{
  /* Power on ICACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;

  /* Set back system and CPU clock source to HSI */
  __HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
  __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);

  HAL_Init();

  SCB_EnableICache();

#if defined(USE_DCACHE)
  /* Power on DCACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk;
  SCB_EnableDCache();
#endif

  SystemClock_Config();

  CONSOLE_Config();
  Logger_Init();
  LOG_INFO(LOG_TAG_SYS, "console ready at 115200 baud");

  LOG_TRACE(LOG_TAG_SYS, "NPURam_enable begin");
  NPURam_enable();
  LOG_TRACE(LOG_TAG_SYS, "NPURam_enable OK");

