Wafleem/STM32N6-EdgeAI-CV/Application/NUCLEO-N657X0-Q/Src/main.c
static void IAC_Config(void)
{
/* Configure IAC to trap illegal access events */
  __HAL_RCC_IAC_CLK_ENABLE();
  __HAL_RCC_IAC_FORCE_RESET();
  __HAL_RCC_IAC_RELEASE_RESET();
}

void IAC_IRQHandler(void)
{
  printf("ERROR: IAC_IRQHandler triggered\n");
  while (1)
  {
  }
}

void Display_InvalidateCameraBuffer(void)
{
  SCB_InvalidateDCache_by_Addr(lcd_bg_buffer, sizeof(lcd_bg_buffer));
}

static float32_t Display_ClampF32(float32_t value, float32_t min_value, float32_t max_value)
{
  if (value < min_value)
  {
    return min_value;
  }
  if (value > max_value)
  {
    return max_value;
  }
  return value;
}

static void Display_DrawThickRect(uint32_t x0, uint32_t y0, uint32_t width, uint32_t height, uint32_t color)
{
  const uint32_t thickness = 3U;

  if ((width <= thickness) || (height <= thickness))
  {
    UTIL_LCD_DrawRect(x0, y0, width, height, color);
    return;
  }

  UTIL_LCD_FillRect(x0, y0, width, thickness, color);
  UTIL_LCD_FillRect(x0, y0 + height - thickness, width, thickness, color);
  UTIL_LCD_FillRect(x0, y0, thickness, height, color);
  UTIL_LCD_FillRect(x0 + width - thickness, y0, thickness, height, color);
}

/**
* @brief Display Neural Network output classification results as well as other performances informations
*
* @param p_postprocess pointer to postprocessing output
* @param inference_ms inference time in ms
*/
static void Display_NetworkOutput(od_pp_out_t *p_postprocess, uint32_t inference_ms)
{

  od_pp_outBuffer_t *rois = p_postprocess->pOutBuff;
  uint32_t nb_rois = p_postprocess->nb_detect;
  uint32_t drawn_rois = 0U;
  static uint32_t display_frame_count = 0U;
  uint32_t roi_area_width = lcd_fg_area.XSize;
  uint32_t roi_area_height = lcd_fg_area.YSize;
  int ret;

  __disable_irq();
  ret = SCRL_SetAddress_NoReload(lcd_fg_buffer[lcd_fg_buffer_rd_idx], SCRL_LAYER_1);
  assert(ret == HAL_OK);
  __enable_irq();

  /* Draw bounding boxes */
  memset(lcd_fg_buffer, 0, sizeof(lcd_fg_buffer));
  UTIL_LCD_FillRect(0, 0, lcd_fg_area.XSize, lcd_fg_area.YSize, UTIL_LCD_COLOR_TRANSPARENT); /* Clear previous boxes */

  for (int32_t i = 0; i < nb_rois; i++)
  {
    uint32_t box_color = Display_GetBoxColor(rois[i].class_index);
    float32_t x1 = rois[i].x_center - (rois[i].width * 0.5f);
    float32_t y1 = rois[i].y_center - (rois[i].height * 0.5f);
    float32_t x2 = rois[i].x_center + (rois[i].width * 0.5f);
    float32_t y2 = rois[i].y_center + (rois[i].height * 0.5f);
    uint32_t x0;
    uint32_t y0;
    uint32_t width;
    uint32_t height;

    if ((x2 <= 0.0f) || (y2 <= 0.0f) || (x1 >= 1.0f) || (y1 >= 1.0f))
    {
      continue;
    }

    x1 = Display_ClampF32(x1, 0.0f, 1.0f);
    y1 = Display_ClampF32(y1, 0.0f, 1.0f);
    x2 = Display_ClampF32(x2, 0.0f, 1.0f);
    y2 = Display_ClampF32(y2, 0.0f, 1.0f);

    if (((x2 - x1) < 0.035f) || ((y2 - y1) < 0.035f))
    {
      continue;
    }

    x0 = (uint32_t)(x1 * ((float32_t)roi_area_width));
    y0 = (uint32_t)(y1 * ((float32_t)roi_area_height));
    width = (uint32_t)((x2 - x1) * ((float32_t)roi_area_width));
    height = (uint32_t)((y2 - y1) * ((float32_t)roi_area_height));

    if ((width < 3U) || (height < 3U))
    {
      continue;
    }

    if ((x0 + width) >= roi_area_width)
    {
      width = roi_area_width - x0 - 1U;
    }
    if ((y0 + height) >= roi_area_height)
    {
      height = roi_area_height - y0 - 1U;
    }

    UTIL_LCD_SetTextColor(box_color);
    Display_DrawThickRect(x0, y0, width, height, box_color);
    drawn_rois++;
  }

  UTIL_LCD_SetBackColor(0x40000000);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);
  UTIL_LCDEx_PrintfAt(0, LINE(0), LEFT_MODE, "Inference");
  UTIL_LCDEx_PrintfAt(0, LINE(1), LEFT_MODE, "%ums", inference_ms);
  UTIL_LCDEx_PrintfAt(0, LINE(0), RIGHT_MODE, "Objects %u", drawn_rois);
  UTIL_LCD_SetBackColor(0);

  Display_WelcomeScreen();

  if (ShouldTraceFrame(display_frame_count) != 0U)
  {
    printf("TRACE: display: frame=%lu raw=%lu drawn=%lu fg=%lux%lu@%lu,%lu bg=%lux%lu@%lu,%lu\n",
           (unsigned long)display_frame_count,
           (unsigned long)nb_rois,
           (unsigned long)drawn_rois,
           (unsigned long)lcd_fg_area.XSize,
           (unsigned long)lcd_fg_area.YSize,
           (unsigned long)lcd_fg_area.X0,
           (unsigned long)lcd_fg_area.Y0,
           (unsigned long)lcd_bg_area.XSize,
           (unsigned long)lcd_bg_area.YSize,
           (unsigned long)lcd_bg_area.X0,
           (unsigned long)lcd_bg_area.Y0);
  }
  display_frame_count++;

  SCB_CleanDCache_by_Addr(lcd_fg_buffer[lcd_fg_buffer_rd_idx], LCD_FG_FRAMEBUFFER_SIZE);
  __disable_irq();
  ret = SCRL_ReloadLayer(SCRL_LAYER_1);
  assert(ret == HAL_OK);
  __enable_irq();
  lcd_fg_buffer_rd_idx = 1 - lcd_fg_buffer_rd_idx;
}

static uint32_t Display_GetBoxColor(uint32_t class_index)
{
  if (class_index == 0U)
  {
    return UTIL_LCD_COLOR_GREEN;
  }

  if (class_index == 1U)
  {
    return UTIL_LCD_COLOR_RED;
  }

  return colors[class_index % NUMBER_COLORS];
}

static void Display_init(void)
{
  SCRL_LayerConfig layers_config[2] = {
    {
      .origin = {lcd_bg_area.X0, lcd_bg_area.Y0},
      .size = {lcd_bg_area.XSize, lcd_bg_area.YSize},
      .format = SCRL_RGB565,
      .address = lcd_bg_buffer,
    },
    {
      .origin = {lcd_fg_area.X0, lcd_fg_area.Y0},
      .size = {lcd_fg_area.XSize, lcd_fg_area.YSize},
      .format = SCRL_ARGB4444,
      .address = lcd_fg_buffer[lcd_fg_buffer_rd_idx],
    },
  };
  SCRL_ScreenConfig screen_config = {
    .size = {LCD_FG_WIDTH, LCD_FG_HEIGHT},
#ifdef SCR_LIB_USE_SPI
    .format = SCRL_RGB565,
#else
    .format = SCRL_YUV422, /* Use SCRL_RGB565 if host support this format to reduce cpu load */
#endif
    .address = screen_buffer,
    .fps = CAMERA_FPS,
  };
  int ret;

  /* Initialize the LCD to black */
#ifdef SCR_LIB_USE_SPI
  memset(screen_buffer, 0, sizeof(screen_buffer));
  SCB_CleanDCache_by_Addr(screen_buffer, sizeof(screen_buffer));
#else
  uint32_t *p_screen_buffer = (uint32_t *) screen_buffer;
  for (int i = 0; i < sizeof(screen_buffer)/4; i++)
  {
    p_screen_buffer[i] = 0x80108010;
  }
  SCB_CleanDCache_by_Addr(screen_buffer, sizeof(screen_buffer));
#endif

  ret = SCRL_Init((SCRL_LayerConfig *[2]){&layers_config[0], &layers_config[1]}, &screen_config);
  printf("TRACE: Display_init: SCRL_Init ret=%d screen=%lux%lu fps=%lu format=0x%08lX\n",
         ret,
         (unsigned long) screen_config.size.width,
         (unsigned long) screen_config.size.height,
         (unsigned long) screen_config.fps,
         (unsigned long) screen_config.format);
  assert(ret == 0);

